backend: tensorflow
class_name: Sequential
config:
- class_name: InputLayer
  config:
    batch_input_shape: !!python/tuple [null, 40, 40, 1]
    dtype: float32
    name: input_1
    sparse: false
- class_name: ImageRescale
  config: {method: 2, name: image_rescale_1, scale: 4, trainable: false}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: &id001 !!python/tuple [1, 1]
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [9, 9]
    name: conv2d_1
    padding: same
    strides: &id002 !!python/tuple [1, 1]
    trainable: true
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [1, 1]
    name: conv2d_2
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Conv2D
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 1
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5, 5]
    name: conv2d_3
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
keras_version: 2.1.4
